select count(*)
from movie_info.movie_distribution a
right outer join movie_info.movie_master b
on a.movie_id = b.movie_id;

select count(*)
from movie_info.movie_master a
left outer join movie_info.movie_production b
on a.movie_id = b.movie_id;

select count(*)
FROM movie_info.movie_master AS a
left outer join movie_info.movie_sales b
on a.movie_id = b.movie_id;

INSERT INTO movie_info.movie_distribution (
    movie_id,
    movie_name,
    distributor,
    created_at,
    created_by,
    updated_at,
    updated_by
)
VALUES
    ('20259781', '토이 스토리 5', '월트디즈니컴퍼니코리아 유한책임회사', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20242402', '눈동자', '(주)바이포엠스튜디오', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20242402', '눈동자', '이화배컴퍼니(주)', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20252402', '군체', '(주)쇼박스', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20248252', '와일드 씽', '롯데컬처웍스(주)롯데엔터테인먼트', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20263030', '백룸', '(주)바이포엠스튜디오', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20263030', '백룸', '리바이브콘텐츠  주식회사', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20250655', '디스클로저 데이', '유니버설픽쳐스인터내셔널  코리아(유)', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20259626', '마이클', '유니버설픽쳐스인터내셔널  코리아(유)', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20250489', '슈퍼걸', '워너브러더스  코리아(주)', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20258236', '만달로리안과 그로구', '월트디즈니컴퍼니코리아  유한책임회사', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20263512', '이상한 과자 가게 전천당', '메가박스중앙(주)  플러스엠 엔터테인먼트', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20259773', '슈퍼 마리오 갤럭시', '유니버설픽쳐스인터내셔널  코리아(유)', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20259791', '악마는 프라다를 입는다 2', '월트디즈니컴퍼니코리아  유한책임회사', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20254121', '살목지', '(주)쇼박스', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20261782', '프로젝트 헤일메리', '소니픽쳐스엔터테인먼트코리아주식회사극장배급지점', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20240532', '짱구', '(주)바이포엠스튜디오', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20242837', '왕과 사는 남자', '(주)쇼박스', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20247648', '내 이름은', '씨제이  씨지브이(CJ CGV)(주)', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20247648', '내 이름은', '와이드 릴리즈(주)', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20262685', '란 12.3', '(주)넥스트엔터테인먼트월드(NEW)', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20192680', '끝장수사', '(주)에이스메이커무비웍스', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20261666', '네가 마지막으로 남긴 노래', '(주)넥스트엔터테인먼트월드(NEW)', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20261666', '네가 마지막으로 남긴 노래', '(주)팬엔터테인먼트', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20256283', '호퍼스', '월트디즈니컴퍼니코리아  유한책임회사', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20241266', '휴민트', '(주)넥스트엔터테인먼트월드(NEW)', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20232662', '삼악도', 'TCO(주)더콘텐츠온', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20241575', '메소드연기', '(주)바이포엠스튜디오', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20261906', '명탐정 코난: 세기말의 마술사', '(주)씨제이이엔엠', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20252373', '넘버원', '(주)바이포엠스튜디오', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20261439', '2024.12.03 그날 조작된 내란, 감춰진 진실', '루디아코프', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20250878', '노 머시: 90분', '소니픽쳐스엔터테인먼트코리아주식회사극장배급지점', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20261208', '귀신 부르는 앱: 영', '(주)삼백상회', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20261526', '아이엠스타!X프리파라 더 무비 -만남의 기적!-', '동우에이앤이(주)', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20250482', '신비아파트 10주년 극장판: 한 번 더, 소환', '(주)씨제이이엔엠', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20250188', '하트맨', '롯데컬처웍스(주)롯데엔터테인먼트', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20249624', '프로젝트 Y', '메가박스중앙(주)  플러스엠 엔터테인먼트', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj'),
    ('20256173', '스폰지밥 무비: 네모바지를 찾아서', '롯데컬처웍스(주)롯데엔터테인먼트', DATE '2026-07-31', 'cmj', DATE '2026-07-31', 'cmj');
